spec/fixtures/paypal/webhook_payment_sale_denied.json

{
  "id": "WH-5FT34115A7647053P-0X60234332960400T",
  "create_time": "2018-11-16T18:21:34.729Z",
  "resource_type": "sale",
  "event_type": "PAYMENT.SALE.DENIED",
  "summary": "Payment completed for EUR 89.99 EUR",
  "resource": {
    "billing_agreement_id": "I-VNL500RLL0B3",
    "amount": {
      "total": "89.99",
      "currency": "EUR",
      "details": {
        "subtotal": "89.99"
      }
    },
    "payment_mode": "INSTANT_TRANSFER",
    "update_time": "2018-11-16T18:20:58Z",
    "create_time": "2018-11-16T18:20:58Z",
    "protection_eligibility_type": "ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE",
    "transaction_fee": {
      "value": "3.86",
      "currency": "EUR"
    },
    "protection_eligibility": "ELIGIBLE",
    "links": [
      {
        "href": "https://api.sandbox.paypal.com/v1/payments/sale/55H19988Y39998736",
        "rel": "self",
        "method": "GET"
      },
      {
        "href": "https://api.sandbox.paypal.com/v1/payments/sale/55H19988Y39998736/refund",
        "rel": "refund",
        "method": "POST"
      }
    ],
    "id": "55H19988Y39998736",
    "state": "completed",
    "invoice_number": ""
  },
  "status": "SUCCESS",
  "transmissions": [
    {
      "webhook_url": "https://staging.learnsignal.com/api/paypal_webhooks",
      "response_headers": {
        "SERVER_INFO": "",
        "Status": "204 No Content",
        "X-Frame-Options": "DENY",
        "Cache-Control": "no-cache",
        "Server": "nginx/1.12.1 + Phusion Passenger 4.0.60",
        "X-Request-Id": "83a1d2ea-6089-46d2-9a80-98b1cacbd9df",
        "X-Runtime": "0.057305",
        "Connection": "keep-alive",
        "Set-Cookie": "ahoy_track=true; path=/",
        "HTTP/1.1 204 No Content": "",
        "Date": "Fri, 16 Nov 2018 18:29:54 GMT",
        "X-Powered-By": "Phusion Passenger 4.0.60"
      },
      "transmission_id": "73275d80-e9cc-11e8-b8f4-0de0de4a06f7",
      "status": "SUCCESS",
      "timestamp": "2018-11-16T18:21:34Z"
    }
  ],
  "links": [
    {
      "href": "https://api.sandbox.paypal.com/v1/notifications/webhooks-events/WH-5FT34115A7647053P-0X60234332960400T",
      "rel": "self",
      "method": "GET",
      "encType": "application/json"
    },
    {
      "href": "https://api.sandbox.paypal.com/v1/notifications/webhooks-events/WH-5FT34115A7647053P-0X60234332960400T/resend",
      "rel": "resend",
      "method": "POST",
      "encType": "application/json"
    }
  ],
  "event_version": "1.0"
}
